openfoam9/tutorials/combustion/reactingFoam/RAS/membrane/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-2.5 -1.2 -3.0)
    ( 2.5 -1.2 -3.0)
    (-2.5  1.2 -3.0)
    ( 2.5  1.2 -3.0)

    (-2.5 -1.2  3.0)
    ( 2.5 -1.2  3.0)
    (-2.5  1.2  3.0)
    ( 2.5  1.2  3.0)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (50 24 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);

mergePatchPairs
(
);

// ************************************************************************* //
